src/cf/InformationRegisters/СостоянияСогласованияВДокументообороте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияСогласованияВДокументообороте</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласованияВДокументообороте</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/GDS_РемонтныеЛисты/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Методы для работы с ремонтными листами
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

Функция НоменклатураИспользуемаяВНесогласованныхРемЛистах(ТекущийРемЛист, СписокНоменклатуры, Склад) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТекущийРемЛист", Документы.уатРемонтныйЛист.ПустаяСсылка());
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уатРемонтныйЛистМатериалы.Номенклатура КАК Номенклатура,
	|	СУММА(уатРемонтныйЛистМатериалы.Количество) КАК Количество
	|ИЗ
	|	Документ.уатРемонтныйЛист.Материалы КАК уатРемонтныйЛистМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСогласованияВДокументообороте КАК СостоянияСогласованияВДокументообороте
	|		ПО уатРемонтныйЛистМатериалы.Ссылка = СостоянияСогласованияВДокументообороте.ИдентификаторОбъектаДО
	|ГДЕ
	|	НЕ уатРемонтныйЛистМатериалы.Ссылка.ПометкаУдаления
	|	И уатРемонтныйЛистМатериалы.Ссылка.GDS_СкладВБП = &Склад
	|	И уатРемонтныйЛистМатериалы.Номенклатура В(&СписокНоменклатуры)
	|	И уатРемонтныйЛистМатериалы.Ссылка <> &ТекущийРемЛист
	|	И (СостоянияСогласованияВДокументообороте.Состояние ЕСТЬ NULL
	|			ИЛИ СостоянияСогласованияВДокументообороте.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияСогласованияВДокументообороте.Согласован))
	|
	|СГРУППИРОВАТЬ ПО
	|	уатРемонтныйЛистМатериалы.Номенклатура";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
